"use strict"
//========================== Циклы FOR и WHILE =============================
// ----------------------- задача 1 ------------------------------
let num = 0;
while(num < 5) {
    console.log(++num);
}

let num1 = 0;
do {
    ++num1;
    console.log(num1);
}
while (num1 < 5);

for (let num2 = 0; num2 <= 5; ++num2){
    if (num2 == 0) continue;
    console.log(num2);
}

// ----------------------- задача 2 ------------------------------
let num3 = 8;
while (num3) {
    console.log(num3);
    num3--;
}

// ----------------------- задача 3 ------------------------------

let num4 = 0;
while (num4 < 3){
    console.log(`Число: ${num4}`);
    num4++;
}

// ----------------------- задача 3 ------------------------------

firstFor: for (let num5 = 0; num5 < 2; num5++) {
    for (let size = 0; size < 3; size++) {
        if (size == 1) {
            break firstFor;
        }
        console.log(size);
    }
}

// ====================== Числа в JAVASCRIPT. ===========================

// ----------------------- задача 1 ------------------------------

let numOne = Math.round((1.005 + Number.EPSILON) * 100) / 100;
console.log(numOne);

// ----------------------- задача 2 ------------------------------

let value1 = parseFloat("135.58px");
console.log(value1);

// ----------------------- задача 3 ------------------------------

let value2 = 58 + "Фрилансер";
if (isNaN(value2)) {
    console.log('Результат выражения NaN');
    console.log(typeof(value2));
}

// ----------------------- задача 4 ------------------------------

console.log(Math.max(10, 58, 39, -150, 0));

// ----------------------- задача 5 ------------------------------

console.log(Math.floor (58.858));

// ====================== Строки в JAVASCRIPT ===========================

// ----------------------- задача 2 ------------------------------

let text = 'фрілансер';
let symbol = text[5];
console.log(symbol);

// ----------------------- задача 4 ------------------------------

let text1 = 'фрілансер';
console.log(text1.toUpperCase());

// ----------------------- задача 5 ------------------------------

let text2 = 'фрілансер';
console.log(text2.indexOf('лан'));